app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs"
---
  def index
    # 記事を全件取得
    @blogs = Blog.all

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "blogs" SET "title" = ?, "category" = ?, "body" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["title", "vano dfaror jfaroir afha"], ["category", "vine"], ["body", "Lorem ipsum dolor sitamet, consectetur"], ["updated_at", "2020-03-21 03:20:36.042896"], ["id", 1]]
---
  def update
    blog = Blog.find(params[:id])
    blog.update(blog_params)